---
kind: method
id: M:Autodesk.Revit.DB.FaceArray.Clear
source: html/06e056e7-5595-fa58-c21c-c4bd73896792.htm
---
# Autodesk.Revit.DB.FaceArray.Clear Method

Removes every face from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```